//^[^aA]{6,}$ - регулярний вираз;
// ^ — початок рядка.
// [^aA] — будь-який символ, окрім літер «A» та «a», Это инвертированный класс символов
// {6,} — повторення цього символу 6 або більше разів. Это обозначает "не менее 6 символов, подходящих под предыдущий шаблон".
// $ — кінець рядка.
// Что оно проверяет? 
// Состоят из 6 или более символов.
// Эти символы могут быть любыми, но они не могут быть буквами a или A.

// console.log(regex.test("Wonderful"));  // true, так как это слово не содержит 'a' или 'A', и длина больше 6
// console.log(regex.test("Joyful"));     // true, так как это слово не содержит 'a' или 'A', и длина больше 6
// console.log(regex.test("Happiness"));  // false, так как это слово содержит букву 'A'
// console.log(regex.test("Time"));       // false, так как это слово содержит букву 'A'
// console.log(regex.test("Task"));       // false, так как это слово содержит букву 'A'
// console.log(regex.test("Apple"));      // false, так как это слово содержит букву 'A'
// console.log(regex.test("Banana"));     // false, так как это слово содержит букву 'A'






// Регулярний вираз:
// ^[a-zA-Z0-9]+: Перше слово перед @ повинно бути хоча б з одного символа, що може бути латинською літерою або цифрою.
// (\.[a-zA-Z0-9]+)*: Дозволяє додавати крапку та ще одне слово, яке також складається з літер або цифр.
// @: Один знак @.
// ((gmail\.com)|(yahoo\.com)): Домен має бути або gmail.com, або yahoo.com.

// Метод .filter() пройде по кожному об'єкту в масиві та за допомогою методу .test() перевірить, чи відповідає email заданому регулярному виразу.
